TOPIC_NAME = "2. Відношення, пропорції та відсотки"
TASKS = [
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть $15\%$ від числа $240$.",
        "svg_code": "",
        "options": [
            (r"А) $360$", False),
            (r"Б) $16$", False),
            (r"В) $204$", False),
            (r"Г) $36$", True),
            (r"Д) $276$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть $35\%$ від числа $120$.",
        "svg_code": "",
        "options": [
            (r"А) $420$", False),
            (r"Б) $\frac{24}{7}$", False),
            (r"В) $162$", False),
            (r"Г) $42$", True),
            (r"Д) $78$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть $45\%$ від числа $200$.",
        "svg_code": "",
        "options": [
            (r"А) $90$", True),
            (r"Б) $290$", False),
            (r"В) $\frac{40}{9}$", False),
            (r"Г) $900$", False),
            (r"Д) $110$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть $120\%$ від числа $50$.",
        "svg_code": "",
        "options": [
            (r"А) $\frac{5}{12}$", False),
            (r"Б) $600$", False),
            (r"В) $60$", True),
            (r"Г) $110$", False),
            (r"Д) $-10$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "MATCH",
        "difficulty": 1,
        "text": r"Узгодьте величину (1–3) з її значенням (А–Д).",
        "svg_code": "",
        "options": [
            r"А) $51$",
            r"Б) $28$",
            r"В) $280$",
            r"Г) $\frac{175}{4}$",
            r"Д) $135$"
        ],
        "matches": [
            (r"1. $8\%$ від числа $350$", r"Б) $28$"),
            (r"2. $60\%$ від числа $85$", r"А) $51$"),
            (r"3. $30\%$ від числа $450$", r"Д) $135$")
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "SHORT",
        "difficulty": 1,
        "text": r"Знайдіть $18\%$ від числа $150$.",
        "svg_code": "",
        "answer": "27",
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "SHORT",
        "difficulty": 1,
        "text": r"Знайдіть $55\%$ від числа $40$.",
        "svg_code": "",
        "answer": "22",
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть число, якщо $20\%$ числа дорівнюють $36$.",
        "svg_code": "",
        "options": [
            (r"А) $180$", True),
            (r"Б) $16$", False),
            (r"В) $56$", False),
            (r"Г) $\frac{36}{5}$", False),
            (r"Д) $\frac{9}{25}$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть число, якщо $12\%$ числа дорівнюють $54$.",
        "svg_code": "",
        "options": [
            (r"А) $66$", False),
            (r"Б) $450$", True),
            (r"В) $\frac{162}{25}$", False),
            (r"Г) $42$", False),
            (r"Д) $\frac{27}{50}$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть число, якщо $45\%$ числа дорівнюють $81$.",
        "svg_code": "",
        "options": [
            (r"А) $36$", False),
            (r"Б) $\frac{729}{20}$", False),
            (r"В) $180$", True),
            (r"Г) $126$", False),
            (r"Д) $\frac{81}{100}$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "SHORT",
        "difficulty": 2,
        "text": r"Знайдіть число, якщо $8\%$ числа дорівнюють $40$.",
        "svg_code": "",
        "answer": "500",
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "SHORT",
        "difficulty": 2,
        "text": r"Знайдіть число, якщо $15\%$ числа дорівнюють $90$.",
        "svg_code": "",
        "answer": "600",
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Скільки відсотків становить зміна ціни товару, якщо вона зросла з $200$ до $250$?",
        "svg_code": "",
        "options": [
            (r"А) $26\%$", False),
            (r"Б) $50\%$", False),
            (r"В) $20\%$", False),
            (r"Г) $25\%$", True),
            (r"Д) $125\%$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Скільки відсотків становить зміна ціни товару, якщо вона зросла з $50$ до $65$?",
        "svg_code": "",
        "options": [
            (r"А) $30\%$", True),
            (r"Б) $15\%$", False),
            (r"В) $\frac{300}{13}\%$", False),
            (r"Г) $130\%$", False),
            (r"Д) $31\%$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Скільки відсотків становить зміна ціни товару, якщо вона зросла з $80$ до $100$?",
        "svg_code": "",
        "options": [
            (r"А) $24\%$", False),
            (r"Б) $20\%$", False),
            (r"В) $26\%$", False),
            (r"Г) $125\%$", False),
            (r"Д) $25\%$", True)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Скільки відсотків становить зміна ціни товару, якщо вона зросла з $120$ до $150$?",
        "svg_code": "",
        "options": [
            (r"А) $20\%$", False),
            (r"Б) $26\%$", False),
            (r"В) $30\%$", False),
            (r"Г) $125\%$", False),
            (r"Д) $25\%$", True)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Розв'яжіть пропорцію $\frac{2}{5} = \frac{6}{x}$.",
        "svg_code": "",
        "options": [
            (r"А) $\frac{12}{5}$", False),
            (r"Б) $\frac{5}{3}$", False),
            (r"В) $13$", False),
            (r"Г) $\frac{5}{12}$", False),
            (r"Д) $15$", True)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Розв'яжіть пропорцію $\frac{3}{4} = \frac{9}{x}$.",
        "svg_code": "",
        "options": [
            (r"А) $\frac{4}{27}$", False),
            (r"Б) $16$", False),
            (r"В) $12$", True),
            (r"Г) $\frac{27}{4}$", False),
            (r"Д) $\frac{4}{3}$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Розв'яжіть пропорцію $\frac{5}{8} = \frac{15}{x}$.",
        "svg_code": "",
        "options": [
            (r"А) $\frac{8}{75}$", False),
            (r"Б) $\frac{75}{8}$", False),
            (r"В) $28$", False),
            (r"Г) $\frac{8}{3}$", False),
            (r"Д) $24$", True)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Розв'яжіть пропорцію $\frac{4}{7} = \frac{12}{x}$.",
        "svg_code": "",
        "options": [
            (r"А) $23$", False),
            (r"Б) $\frac{7}{48}$", False),
            (r"В) $21$", True),
            (r"Г) $\frac{48}{7}$", False),
            (r"Д) $\frac{7}{3}$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "SHORT",
        "difficulty": 1,
        "text": r"Розв'яжіть пропорцію $\frac{3}{10} = \frac{18}{x}$.",
        "svg_code": "",
        "answer": "60",
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "SHORT",
        "difficulty": 1,
        "text": r"Розв'яжіть пропорцію $\frac{7}{2} = \frac{21}{x}$.",
        "svg_code": "",
        "answer": "6",
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Ціну товару спочатку підвищили на $20\%$, а потім знизили на $10\%$. Скільки відсотків від початкової ціни становить остаточна ціна?",
        "svg_code": "",
        "options": [
            (r"А) $130\%$", False),
            (r"Б) $108\%$", True),
            (r"В) $30\%$", False),
            (r"Г) $110\%$", False),
            (r"Д) $90\%$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Ціну товару спочатку підвищили на $50\%$, а потім знизили на $20\%$. Скільки відсотків від початкової ціни становить остаточна ціна?",
        "svg_code": "",
        "options": [
            (r"А) $170\%$", False),
            (r"Б) $70\%$", False),
            (r"В) $130\%$", False),
            (r"Г) $120\%$", True),
            (r"Д) $80\%$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Ціну товару спочатку підвищили на $10\%$, а потім знизили на $10\%$. Скільки відсотків від початкової ціни становить остаточна ціна?",
        "svg_code": "",
        "options": [
            (r"А) $120\%$", False),
            (r"Б) $100\%$", False),
            (r"В) $20\%$", False),
            (r"Г) $90\%$", False),
            (r"Д) $99\%$", True)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Ціну товару спочатку підвищили на $40\%$, а потім знизили на $25\%$. Скільки відсотків від початкової ціни становить остаточна ціна?",
        "svg_code": "",
        "options": [
            (r"А) $165\%$", False),
            (r"Б) $65\%$", False),
            (r"В) $105\%$", True),
            (r"Г) $75\%$", False),
            (r"Д) $115\%$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Відомо: $5$ робітників виконують роботу за $12$ днів. За скільки днів цю роботу виконають $3$ робітників?",
        "svg_code": "",
        "options": [
            (r"А) $14$", False),
            (r"Б) $20$", True),
            (r"В) $\frac{36}{5}$", False),
            (r"Г) $\frac{41}{5}$", False),
            (r"Д) $9$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Відомо: $6$ робітників виконують роботу за $8$ днів. За скільки днів цю роботу виконають $4$ робітників?",
        "svg_code": "",
        "options": [
            (r"А) $\frac{19}{3}$", False),
            (r"Б) $10$", False),
            (r"В) $12$", True),
            (r"Г) $4$", False),
            (r"Д) $\frac{16}{3}$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Відомо: $8$ робітників виконують роботу за $9$ днів. За скільки днів цю роботу виконають $6$ робітників?",
        "svg_code": "",
        "options": [
            (r"А) $\frac{27}{4}$", False),
            (r"Б) $12$", True),
            (r"В) $\frac{31}{4}$", False),
            (r"Г) $11$", False),
            (r"Д) $3$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "SHORT",
        "difficulty": 2,
        "text": r"Відомо: $10$ робітників виконують роботу за $6$ днів. За скільки днів цю роботу виконають $4$ робітників?",
        "svg_code": "",
        "answer": "15",
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "SHORT",
        "difficulty": 2,
        "text": r"Відомо: $9$ робітників виконують роботу за $8$ днів. За скільки днів цю роботу виконають $6$ робітників?",
        "svg_code": "",
        "answer": "12",
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть більшу з частин, якщо число $60$ розділили у відношенні $2 : 3$.",
        "svg_code": "",
        "options": [
            (r"А) $24$", False),
            (r"Б) $58$", False),
            (r"В) $25$", False),
            (r"Г) $36$", True),
            (r"Д) $30$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть більшу з частин, якщо число $84$ розділили у відношенні $5 : 7$.",
        "svg_code": "",
        "options": [
            (r"А) $42$", False),
            (r"Б) $49$", True),
            (r"В) $36$", False),
            (r"Г) $79$", False),
            (r"Д) $35$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть більшу з частин, якщо число $120$ розділили у відношенні $3 : 5$.",
        "svg_code": "",
        "options": [
            (r"А) $75$", True),
            (r"Б) $117$", False),
            (r"В) $60$", False),
            (r"Г) $46$", False),
            (r"Д) $45$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть більшу з частин, якщо число $72$ розділили у відношенні $1 : 5$.",
        "svg_code": "",
        "options": [
            (r"А) $12$", False),
            (r"Б) $60$", True),
            (r"В) $71$", False),
            (r"Г) $36$", False),
            (r"Д) $13$", False)
        ],
        "topic_tags": ["2. Відношення, пропорції та відсотки"]
    }
]
