TOPIC_NAME = "39. Вступ до стереометрії"
TASKS = [
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть його діагональ, якщо виміри прямокутного паралелепіпеда дорівнюють $1$ см, $2$ см і $2$ см.",
        "svg_code": "",
        "options": [
            (r"А) $4$", False),
            (r"Б) $1$", False),
            (r"В) $2$", False),
            (r"Г) $5$", False),
            (r"Д) $3$", True)
        ],
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть його діагональ, якщо виміри прямокутного паралелепіпеда дорівнюють $2$ см, $6$ см і $9$ см.",
        "svg_code": "",
        "options": [
            (r"А) $17$", False),
            (r"Б) $11$", True),
            (r"В) $10$", False),
            (r"Г) $12$", False),
            (r"Д) $108$", False)
        ],
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть його діагональ, якщо виміри прямокутного паралелепіпеда дорівнюють $4$ см, $4$ см і $7$ см.",
        "svg_code": "",
        "options": [
            (r"А) $15$", False),
            (r"Б) $112$", False),
            (r"В) $9$", True),
            (r"Г) $8$", False),
            (r"Д) $10$", False)
        ],
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть його діагональ, якщо виміри прямокутного паралелепіпеда дорівнюють $6$ см, $6$ см і $7$ см.",
        "svg_code": "",
        "options": [
            (r"А) $252$", False),
            (r"Б) $19$", False),
            (r"В) $12$", False),
            (r"Г) $11$", True),
            (r"Д) $10$", False)
        ],
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "SHORT",
        "difficulty": 2,
        "text": r"Знайдіть його діагональ, якщо виміри прямокутного паралелепіпеда дорівнюють $2$ см, $10$ см і $11$ см.",
        "svg_code": "",
        "answer": "15",
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть площу повної поверхні, якщо виміри прямокутного паралелепіпеда дорівнюють $3$ см, $4$ см і $5$ см.",
        "svg_code": "",
        "options": [
            (r"А) $47$", False),
            (r"Б) $24$", False),
            (r"В) $60$", False),
            (r"Г) $97$", False),
            (r"Д) $94$", True)
        ],
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть площу повної поверхні, якщо виміри прямокутного паралелепіпеда дорівнюють $1$ см, $5$ см і $6$ см.",
        "svg_code": "",
        "options": [
            (r"А) $24$", False),
            (r"Б) $83$", False),
            (r"В) $30$", False),
            (r"Г) $82$", True),
            (r"Д) $41$", False)
        ],
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть площу повної поверхні, якщо виміри прямокутного паралелепіпеда дорівнюють $4$ см, $5$ см і $6$ см.",
        "svg_code": "",
        "options": [
            (r"А) $30$", False),
            (r"Б) $74$", False),
            (r"В) $152$", False),
            (r"Г) $148$", True),
            (r"Д) $120$", False)
        ],
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть об'єм, якщо виміри прямокутного паралелепіпеда дорівнюють $2$ см, $3$ см і $4$ см.",
        "svg_code": "",
        "options": [
            (r"А) $26$", False),
            (r"Б) $9$", False),
            (r"В) $23$", False),
            (r"Г) $52$", False),
            (r"Д) $24$", True)
        ],
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть об'єм, якщо виміри прямокутного паралелепіпеда дорівнюють $5$ см, $6$ см і $2$ см.",
        "svg_code": "",
        "options": [
            (r"А) $65$", False),
            (r"Б) $60$", True),
            (r"В) $104$", False),
            (r"Г) $13$", False),
            (r"Д) $59$", False)
        ],
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "SHORT",
        "difficulty": 1,
        "text": r"Знайдіть об'єм, якщо виміри прямокутного паралелепіпеда дорівнюють $4$ см, $4$ см і $4$ см.",
        "svg_code": "",
        "answer": "64",
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть площу повної поверхні куба, якщо ребро куба дорівнює $3$ см.",
        "svg_code": "",
        "options": [
            (r"А) $57$", False),
            (r"Б) $36$", False),
            (r"В) $18$", False),
            (r"Г) $54$", True),
            (r"Д) $27$", False)
        ],
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть площу повної поверхні куба, якщо ребро куба дорівнює $5$ см.",
        "svg_code": "",
        "options": [
            (r"А) $150$", True),
            (r"Б) $60$", False),
            (r"В) $155$", False),
            (r"Г) $125$", False),
            (r"Д) $100$", False)
        ],
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть ребро куба, якщо діагональ куба дорівнює $4\sqrt{3}$ см.",
        "svg_code": "",
        "options": [
            (r"А) $4$", True),
            (r"Б) $5$", False),
            (r"В) $12$", False),
            (r"Г) $16$", False),
            (r"Д) $\frac{4}{3}$", False)
        ],
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть ребро куба, якщо діагональ куба дорівнює $10\sqrt{3}$ см.",
        "svg_code": "",
        "options": [
            (r"А) $10$", True),
            (r"Б) $11$", False),
            (r"В) $30$", False),
            (r"Г) $100$", False),
            (r"Д) $\frac{10}{3}$", False)
        ],
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"За теоремою Ейлера знайдіть кількість граней, якщо многогранник має $8$ вершин і $12$ ребер.",
        "svg_code": "",
        "options": [
            (r"А) $-4$", False),
            (r"Б) $6$", True),
            (r"В) $7$", False),
            (r"Г) $18$", False),
            (r"Д) $4$", False)
        ],
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"За теоремою Ейлера знайдіть кількість граней, якщо многогранник має $6$ вершин і $9$ ребер.",
        "svg_code": "",
        "options": [
            (r"А) $13$", False),
            (r"Б) $5$", True),
            (r"В) $-3$", False),
            (r"Г) $3$", False),
            (r"Д) $6$", False)
        ],
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"За теоремою Ейлера знайдіть кількість граней, якщо многогранник має $12$ вершин і $18$ ребер.",
        "svg_code": "",
        "options": [
            (r"А) $9$", False),
            (r"Б) $8$", True),
            (r"В) $6$", False),
            (r"Г) $-6$", False),
            (r"Д) $28$", False)
        ],
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Скільки різних площин можна провести через $4$ точки, жодні чотири з яких не лежать в одній площині, а жодні три — на одній прямій?",
        "svg_code": "",
        "options": [
            (r"А) $6$", False),
            (r"Б) $4$", True),
            (r"В) $3$", False),
            (r"Г) $8$", False),
            (r"Д) $24$", False)
        ],
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Скільки різних площин можна провести через $6$ точок, жодні чотири з яких не лежать в одній площині, а жодні три — на одній прямій?",
        "svg_code": "",
        "options": [
            (r"А) $6$", False),
            (r"Б) $20$", True),
            (r"В) $15$", False),
            (r"Г) $120$", False),
            (r"Д) $26$", False)
        ],
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть діагональ цієї грані, якщо прямокутник зі сторонами $3$ см і $4$ см є гранню паралелепіпеда.",
        "svg_code": "",
        "options": [
            (r"А) $4$", False),
            (r"Б) $7$", False),
            (r"В) $5$", True),
            (r"Г) $6$", False),
            (r"Д) $12$", False)
        ],
        "topic_tags": ["39. Вступ до стереометрії"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть діагональ цієї грані, якщо прямокутник зі сторонами $8$ см і $15$ см є гранню паралелепіпеда.",
        "svg_code": "",
        "options": [
            (r"А) $18$", False),
            (r"Б) $17$", True),
            (r"В) $16$", False),
            (r"Г) $23$", False),
            (r"Д) $120$", False)
        ],
        "topic_tags": ["39. Вступ до стереометрії"]
    }
]
