TOPIC_NAME = "33. Прямокутний трикутник"
TASKS = [
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть гіпотенузу, якщо катети прямокутного трикутника дорівнюють $3$ см і $4$ см.",
        "svg_code": "",
        "options": [
            (r"А) $6$", False),
            (r"Б) $1$", False),
            (r"В) $12$", False),
            (r"Г) $5$", True),
            (r"Д) $7$", False)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть гіпотенузу, якщо катети прямокутного трикутника дорівнюють $8$ см і $15$ см.",
        "svg_code": "",
        "options": [
            (r"А) $17$", True),
            (r"Б) $7$", False),
            (r"В) $23$", False),
            (r"Г) $120$", False),
            (r"Д) $18$", False)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть гіпотенузу, якщо катети прямокутного трикутника дорівнюють $6$ см і $8$ см.",
        "svg_code": "",
        "options": [
            (r"А) $48$", False),
            (r"Б) $11$", False),
            (r"В) $2$", False),
            (r"Г) $14$", False),
            (r"Д) $10$", True)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "SHORT",
        "difficulty": 1,
        "text": r"Знайдіть гіпотенузу, якщо катети прямокутного трикутника дорівнюють $20$ см і $21$ см.",
        "svg_code": "",
        "answer": "29",
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть другий катет, якщо гіпотенуза прямокутного трикутника дорівнює $13$ см, а один з катетів — $5$ см.",
        "svg_code": "",
        "options": [
            (r"А) $17$", False),
            (r"Б) $8$", False),
            (r"В) $12$", True),
            (r"Г) $13$", False),
            (r"Д) $18$", False)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть другий катет, якщо гіпотенуза прямокутного трикутника дорівнює $25$ см, а один з катетів — $7$ см.",
        "svg_code": "",
        "options": [
            (r"А) $18$", False),
            (r"Б) $32$", False),
            (r"В) $24$", True),
            (r"Г) $25$", False),
            (r"Д) $31$", False)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть другий катет, якщо гіпотенуза прямокутного трикутника дорівнює $10$ см, а один з катетів — $6$ см.",
        "svg_code": "",
        "options": [
            (r"А) $9$", False),
            (r"Б) $8$", True),
            (r"В) $16$", False),
            (r"Г) $14$", False),
            (r"Д) $4$", False)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть медіану, проведену до гіпотенузи, якщо гіпотенуза прямокутного трикутника дорівнює $5$ см.",
        "svg_code": "",
        "options": [
            (r"А) $\frac{5}{3}$", False),
            (r"Б) $5$", False),
            (r"В) $10$", False),
            (r"Г) $\frac{5}{2}$", True),
            (r"Д) $\frac{7}{2}$", False)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть медіану, проведену до гіпотенузи, якщо гіпотенуза прямокутного трикутника дорівнює $17$ см.",
        "svg_code": "",
        "options": [
            (r"А) $\frac{19}{2}$", False),
            (r"Б) $34$", False),
            (r"В) $\frac{17}{2}$", True),
            (r"Г) $17$", False),
            (r"Д) $\frac{17}{3}$", False)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть радіус вписаного кола, якщо катети прямокутного трикутника дорівнюють $3$ см і $4$ см.",
        "svg_code": "",
        "options": [
            (r"А) $2$", False),
            (r"Б) $1$", True),
            (r"В) $6$", False),
            (r"Г) $\frac{5}{2}$", False),
            (r"Д) $0$", False)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть радіус вписаного кола, якщо катети прямокутного трикутника дорівнюють $8$ см і $15$ см.",
        "svg_code": "",
        "options": [
            (r"А) $6$", False),
            (r"Б) $4$", False),
            (r"В) $3$", True),
            (r"Г) $20$", False),
            (r"Д) $\frac{17}{2}$", False)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть радіус вписаного кола, якщо катети прямокутного трикутника дорівнюють $7$ см і $24$ см.",
        "svg_code": "",
        "options": [
            (r"А) $28$", False),
            (r"Б) $6$", False),
            (r"В) $4$", False),
            (r"Г) $3$", True),
            (r"Д) $\frac{25}{2}$", False)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть висоту, проведену до гіпотенузи, якщо катети прямокутного трикутника дорівнюють $3$ см і $4$ см.",
        "svg_code": "",
        "options": [
            (r"А) $\frac{7}{2}$", False),
            (r"Б) $\frac{12}{5}$", True),
            (r"В) $\frac{17}{5}$", False),
            (r"Г) $\frac{5}{2}$", False),
            (r"Д) $6$", False)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть висоту, проведену до гіпотенузи, якщо катети прямокутного трикутника дорівнюють $8$ см і $15$ см.",
        "svg_code": "",
        "options": [
            (r"А) $\frac{23}{2}$", False),
            (r"Б) $\frac{120}{17}$", True),
            (r"В) $60$", False),
            (r"Г) $\frac{17}{2}$", False),
            (r"Д) $\frac{137}{17}$", False)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть висоту, проведену до гіпотенузи, якщо катети прямокутного трикутника дорівнюють $6$ см і $8$ см.",
        "svg_code": "",
        "options": [
            (r"А) $\frac{29}{5}$", False),
            (r"Б) $24$", False),
            (r"В) $7$", False),
            (r"Г) $5$", False),
            (r"Д) $\frac{24}{5}$", True)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть синус найменшого кута, якщо у прямокутному трикутнику катети $5$ і $12$, гіпотенуза $13$.",
        "svg_code": "",
        "options": [
            (r"А) $\frac{13}{5}$", False),
            (r"Б) $\frac{5}{12}$", False),
            (r"В) $\frac{12}{5}$", False),
            (r"Г) $\frac{5}{13}$", True),
            (r"Д) $\frac{12}{13}$", False)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть синус найменшого кута, якщо у прямокутному трикутнику катети $7$ і $24$, гіпотенуза $25$.",
        "svg_code": "",
        "options": [
            (r"А) $\frac{24}{25}$", False),
            (r"Б) $\frac{24}{7}$", False),
            (r"В) $\frac{7}{25}$", True),
            (r"Г) $\frac{25}{7}$", False),
            (r"Д) $\frac{7}{24}$", False)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть синус найменшого кута, якщо у прямокутному трикутнику катети $6$ і $8$, гіпотенуза $10$.",
        "svg_code": "",
        "options": [
            (r"А) $\frac{4}{5}$", False),
            (r"Б) $\frac{3}{5}$", True),
            (r"В) $\frac{3}{4}$", False),
            (r"Г) $\frac{4}{3}$", False),
            (r"Д) $\frac{5}{3}$", False)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть тангенс найбільшого гострого кута, якщо у прямокутному трикутнику катети $3$ і $4$, гіпотенуза $5$.",
        "svg_code": "",
        "options": [
            (r"А) $\frac{3}{4}$", False),
            (r"Б) $\frac{4}{5}$", False),
            (r"В) $\frac{3}{5}$", False),
            (r"Г) $\frac{5}{3}$", False),
            (r"Д) $\frac{4}{3}$", True)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть тангенс найбільшого гострого кута, якщо у прямокутному трикутнику катети $8$ і $15$, гіпотенуза $17$.",
        "svg_code": "",
        "options": [
            (r"А) $\frac{8}{17}$", False),
            (r"Б) $\frac{15}{17}$", False),
            (r"В) $\frac{8}{15}$", False),
            (r"Г) $\frac{17}{8}$", False),
            (r"Д) $\frac{15}{8}$", True)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть катет, що лежить проти цього кута, якщо гіпотенуза прямокутного трикутника дорівнює $10$ см, а один із гострих кутів — $30^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $10$", False),
            (r"Б) $5$", True),
            (r"В) $\frac{10}{3}$", False),
            (r"Г) $6$", False),
            (r"Д) $20$", False)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть катет, що лежить проти цього кута, якщо гіпотенуза прямокутного трикутника дорівнює $26$ см, а один із гострих кутів — $30^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $\frac{26}{3}$", False),
            (r"Б) $26$", False),
            (r"В) $13$", True),
            (r"Г) $14$", False),
            (r"Д) $52$", False)
        ],
        "topic_tags": ["33. Прямокутний трикутник"]
    }
]
