TOPIC_NAME = "34. Теорема косинусів та теорема синусів"
TASKS = [
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть третю сторону, якщо у трикутнику дві сторони дорівнюють $5$ см і $8$ см, а кут між ними — $60^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $3$", False),
            (r"Б) $7$", True),
            (r"В) $13$", False),
            (r"Г) $8$", False),
            (r"Д) $6$", False)
        ],
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть третю сторону, якщо у трикутнику дві сторони дорівнюють $8$ см і $15$ см, а кут між ними — $60^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $14$", False),
            (r"Б) $7$", False),
            (r"В) $13$", True),
            (r"Г) $23$", False),
            (r"Д) $12$", False)
        ],
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть третю сторону, якщо у трикутнику дві сторони дорівнюють $7$ см і $8$ см, а кут між ними — $120^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $14$", False),
            (r"Б) $13$", True),
            (r"В) $15$", False),
            (r"Г) $12$", False),
            (r"Д) $1$", False)
        ],
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть третю сторону, якщо у трикутнику дві сторони дорівнюють $3$ см і $5$ см, а кут між ними — $120^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $2$", False),
            (r"Б) $6$", False),
            (r"В) $15$", False),
            (r"Г) $8$", False),
            (r"Д) $7$", True)
        ],
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "SHORT",
        "difficulty": 2,
        "text": r"Знайдіть третю сторону, якщо у трикутнику дві сторони дорівнюють $8$ см і $5$ см, а кут між ними — $60^\circ$.",
        "svg_code": "",
        "answer": "7",
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть косинус найбільшого кута трикутника, якщо сторони трикутника дорівнюють $3$ см, $5$ см і $7$ см.",
        "svg_code": "",
        "options": [
            (r"А) $-\frac{1}{2}$", True),
            (r"Б) $\frac{83}{30}$", False),
            (r"В) $\frac{3}{2}$", False),
            (r"Г) $\frac{1}{2}$", False),
            (r"Д) $\frac{17}{15}$", False)
        ],
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть косинус найбільшого кута трикутника, якщо сторони трикутника дорівнюють $5$ см, $7$ см і $8$ см.",
        "svg_code": "",
        "options": [
            (r"А) $-\frac{1}{7}$", False),
            (r"Б) $\frac{37}{35}$", False),
            (r"В) $\frac{1}{7}$", True),
            (r"Г) $\frac{69}{35}$", False),
            (r"Д) $\frac{6}{7}$", False)
        ],
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть косинус найбільшого кута трикутника, якщо сторони трикутника дорівнюють $4$ см, $5$ см і $6$ см.",
        "svg_code": "",
        "options": [
            (r"А) $-\frac{1}{8}$", False),
            (r"Б) $\frac{1}{8}$", True),
            (r"В) $\frac{41}{40}$", False),
            (r"Г) $\frac{7}{8}$", False),
            (r"Д) $\frac{77}{40}$", False)
        ],
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть косинус найбільшого кута трикутника, якщо сторони трикутника дорівнюють $7$ см, $9$ см і $11$ см.",
        "svg_code": "",
        "options": [
            (r"А) $-\frac{1}{14}$", False),
            (r"Б) $\frac{13}{14}$", False),
            (r"В) $\frac{65}{63}$", False),
            (r"Г) $\frac{1}{14}$", True),
            (r"Д) $\frac{251}{126}$", False)
        ],
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть радіус описаного кола, якщо у трикутнику сторона $a = 5$ см лежить проти кута $A = 30^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $\frac{5}{2}$", False),
            (r"Б) $4$", False),
            (r"В) $6$", False),
            (r"Г) $10$", False),
            (r"Д) $5$", True)
        ],
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть радіус описаного кола, якщо у трикутнику сторона $a = 9$ см лежить проти кута $A = 30^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $\frac{9}{2}$", False),
            (r"Б) $18$", False),
            (r"В) $9$", True),
            (r"Г) $8$", False),
            (r"Д) $10$", False)
        ],
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть радіус описаного кола, якщо у трикутнику сторона $a = 7$ см лежить проти кута $A = 150^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $8$", False),
            (r"Б) $7$", True),
            (r"В) $6$", False),
            (r"Г) $\frac{7}{2}$", False),
            (r"Д) $14$", False)
        ],
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть радіус описаного кола, якщо у трикутнику сторона $a = 8$ см лежить проти кута $A = 90^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $16$", False),
            (r"Б) $5$", False),
            (r"В) $8$", False),
            (r"Г) $4$", True),
            (r"Д) $2$", False)
        ],
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть сторону $b$, якщо у трикутнику $a = 6$ см, $\angle A = 30^\circ$, $\angle B = 90^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $13$", False),
            (r"Б) $24$", False),
            (r"В) $12$", True),
            (r"Г) $18$", False),
            (r"Д) $6$", False)
        ],
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть сторону $b$, якщо у трикутнику $a = 10$ см, $\angle A = 90^\circ$, $\angle B = 30^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $10$", False),
            (r"Б) $\frac{5}{2}$", False),
            (r"В) $6$", False),
            (r"Г) $5$", True),
            (r"Д) $15$", False)
        ],
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть діаметр описаного кола, якщо сторона $a = 6\sqrt{3}$ см лежить проти кута $60^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $12$", True),
            (r"Б) $14$", False),
            (r"В) $18$", False),
            (r"Г) $6$", False),
            (r"Д) $24$", False)
        ],
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть діаметр описаного кола, якщо сторона $a = 9\sqrt{3}$ см лежить проти кута $60^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $20$", False),
            (r"Б) $18$", True),
            (r"В) $9$", False),
            (r"Г) $27$", False),
            (r"Д) $36$", False)
        ],
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть $c^2$, якщо у трикутнику $a = 4$, $b = 6$, $\angle C = 60^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $32$", False),
            (r"Б) $28$", True),
            (r"В) $4$", False),
            (r"Г) $52$", False),
            (r"Д) $76$", False)
        ],
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть $c^2$, якщо у трикутнику $a = 3$, $b = 7$, $\angle C = 120^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $82$", False),
            (r"Б) $16$", False),
            (r"В) $79$", True),
            (r"Г) $80$", False),
            (r"Д) $58$", False)
        ],
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть $c^2$, якщо у трикутнику $a = 5$, $b = 5$, $\angle C = 90^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $55$", False),
            (r"Б) $75$", False),
            (r"В) $0$", False),
            (r"Г) $25$", False),
            (r"Д) $50$", True)
        ],
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть $c^2$, якщо у трикутнику $a = 2$, $b = 9$, $\angle C = 120^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $85$", False),
            (r"Б) $104$", False),
            (r"В) $105$", False),
            (r"Г) $49$", False),
            (r"Д) $103$", True)
        ],
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    },
    {
        "type": "SHORT",
        "difficulty": 2,
        "text": r"Знайдіть $c^2$, якщо у трикутнику $a = 7$, $b = 7$, $\angle C = 90^\circ$.",
        "svg_code": "",
        "answer": "98",
        "topic_tags": ["34. Теорема косинусів та теорема синусів"]
    }
]
