TOPIC_NAME = "24. Побудова графіків функцій шляхом геометричних перетворень"
TASKS = [
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Графік функції $y = x^2$ перенесли на $2$ одиниці вліво та на $6$ одиниць вгору. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = (x-2)^2-6$", False),
            (r"Б) $y = (x-6)^2-2$", False),
            (r"В) $y = (x+2)^2-6$", False),
            (r"Г) $y = (x-2)^2+6$", False),
            (r"Д) $y = (x+2)^2+6$", True)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "12. Квадратична функція"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Графік функції $y = |x|$ перенесли на $5$ одиниць вправо та на $2$ одиниці вниз. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = |x-5|+2$", False),
            (r"Б) $y = |x+2|+5$", False),
            (r"В) $y = |x-5|-2$", True),
            (r"Г) $y = |x+5|+2$", False),
            (r"Д) $y = |x+5|-2$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "6. Лінійні рівняння. Лінійні рівняння з модулем"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Графік функції $y = \sqrt{x}$ перенесли на $1$ одиницю вліво та на $3$ одиниці вгору. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = \sqrt{x-1}+3$", False),
            (r"Б) $y = \sqrt{x-1}-3$", False),
            (r"В) $y = \sqrt{x-3}-1$", False),
            (r"Г) $y = \sqrt{x+1}-3$", False),
            (r"Д) $y = \sqrt{x+1}+3$", True)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "9. Корені та їх властивості"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Графік функції $y = \frac{1}{x}$ перенесли на $2$ одиниці вправо та на $5$ одиниць вниз. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = \frac{1}{x-2}-5$", True),
            (r"Б) $y = \frac{1}{x+5}+2$", False),
            (r"В) $y = \frac{1}{x+2}+5$", False),
            (r"Г) $y = \frac{1}{x+2}-5$", False),
            (r"Д) $y = \frac{1}{x-2}+5$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "11. Функції та їх властивості"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Графік функції $y = 2^x$ перенесли на $2$ одиниці вліво та на $1$ одиницю вгору. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = 2^{x+2}-1$", False),
            (r"Б) $y = 2^{x-1}-2$", False),
            (r"В) $y = 2^{x+2}+1$", True),
            (r"Г) $y = 2^{x-2}-1$", False),
            (r"Д) $y = 2^{x-2}+1$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "19. Показникові вирази"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Графік функції $y = (x - 2)^2 + 1$ симетрично відобразили відносно осі $Oy$. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = -(x - 2)^2 - 1$", False),
            (r"Б) $y = (x - 2)^2 - 1$", False),
            (r"В) $y = (x + 2)^2 + 1$", True),
            (r"Г) $y = -(x + 2)^2 + 1$", False),
            (r"Д) $y = (x + 2)^2 - 1$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "12. Квадратична функція"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Графік функції $y = 3^x$ симетрично відобразили відносно осі $Ox$. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = 3^x - 1$", False),
            (r"Б) $y = -3^x$", True),
            (r"В) $y = 3^{-x}$", False),
            (r"Г) $y = \frac{1}{3^x}$", False),
            (r"Д) $y = -3^{-x}$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "19. Показникові вирази"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Графік функції $y = x^3 + x^2$ симетрично відобразили відносно початку координат. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = -x^3 + x^2$", False),
            (r"Б) $y = x^2 - x^3 + 1$", False),
            (r"В) $y = -x^3 - x^2$", False),
            (r"Г) $y = x^3 - x^2$", True),
            (r"Д) $y = x^3 + x^2$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "11. Функції та їх властивості"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Графік функції $y = f(x)$ розтягнули від осі $Ox$ у $5$ разів. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = f(5x)$", False),
            (r"Б) $y = f\left(\frac{x}{5}\right)$", False),
            (r"В) $y = \frac{1}{5}f(x)$", False),
            (r"Г) $y = f(x) + 5$", False),
            (r"Д) $y = 5f(x)$", True)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "11. Функції та їх властивості"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Графік функції $y = f(x)$ стиснули до осі $Oy$ у $3$ рази. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = \frac{1}{3}f(x)$", False),
            (r"Б) $y = f(3x)$", True),
            (r"В) $y = 3f(x)$", False),
            (r"Г) $y = f\left(\frac{x}{3}\right)$", False),
            (r"Д) $y = f(x - 3)$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "11. Функції та їх властивості"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Графік функції $y = f(x)$ розтягнули від осі $Oy$ у $2$ рази. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = 2f(x)$", False),
            (r"Б) $y = f(2x)$", False),
            (r"В) $y = f\left(\frac{x}{2}\right)$", True),
            (r"Г) $y = f(x) - 2$", False),
            (r"Д) $y = \frac{1}{2}f(x)$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "11. Функції та їх властивості"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Графік якої функції можна отримати з графіка функції $y = x^2$ симетричним відображенням відносно осі $Ox$ та перенесенням на $3$ одиниці вгору?",
        "svg_code": "",
        "options": [
            (r"А) $y = (x - 3)^2$", False),
            (r"Б) $y = x^2 - 3$", False),
            (r"В) $y = (x + 3)^2$", False),
            (r"Г) $y = -x^2 + 3$", True),
            (r"Д) $y = -x^2 - 3$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "12. Квадратична функція"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть координати вершини параболи $y = (x - 5)^2 + 2$.",
        "svg_code": "",
        "options": [
            (r"А) $(-5; -2)$", False),
            (r"Б) $(2; 5)$", False),
            (r"В) $(-5; 2)$", False),
            (r"Г) $(5; -2)$", False),
            (r"Д) $(5; 2)$", True)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "12. Квадратична функція"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть координати вершини параболи $y = x^2 + 10x + 7$.",
        "svg_code": "",
        "options": [
            (r"А) $(5; -18)$", False),
            (r"Б) $(-5; 18)$", False),
            (r"В) $(-18; -5)$", False),
            (r"Г) $(-5; -18)$", True),
            (r"Д) $(5; 18)$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "12. Квадратична функція"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Яке найбільше значення має функція $y = 4 - |x - 1|$?",
        "svg_code": "",
        "options": [
            (r"А) $5$", False),
            (r"Б) $4$", True),
            (r"В) $1$", False),
            (r"Г) $-4$", False),
            (r"Д) $3$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "6. Лінійні рівняння. Лінійні рівняння з модулем"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Точка $D(-2; 1)$ належить графіку функції $y = f(x)$. Яка з точок обов'язково належить графіку функції $y = f(x + 1) - 3$?",
        "svg_code": "",
        "options": [
            (r"А) $(-1; -2)$", False),
            (r"Б) $(-3; -2)$", True),
            (r"В) $(-2; 1)$", False),
            (r"Г) $(-1; 4)$", False),
            (r"Д) $(-3; 4)$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "11. Функції та їх властивості"]
    },
    {
        "type": "MATCH",
        "difficulty": 2,
        "text": r"Узгодьте функцію (1–3) із перетворенням графіка функції $y = \sqrt{x}$ (А–Д), яким її можна отримати.",
        "svg_code": "",
        "options": [
            r"А) Перенесення вправо на $4$ одиниці",
            r"Б) Перенесення вліво на $4$ одиниці",
            r"В) Перенесення вгору на $4$ одиниці",
            r"Г) Перенесення вниз на $4$ одиниці",
            r"Д) Симетричне відображення відносно осі $Ox$"
        ],
        "matches": [
            (r"1. $y = \sqrt{x - 4}$", r"А) Перенесення вправо на $4$ одиниці"),
            (r"2. $y = \sqrt{x} + 4$", r"В) Перенесення вгору на $4$ одиниці"),
            (r"3. $y = -\sqrt{x}$", r"Д) Симетричне відображення відносно осі $Ox$")
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "9. Корені та їх властивості"]
    },
    {
        "type": "MATCH",
        "difficulty": 3,
        "text": r"Узгодьте функцію (1–3) із найменшим значенням, якого вона набуває (А–Д).",
        "svg_code": "",
        "options": [
            r"А) $-5$",
            r"Б) $5$",
            r"В) $-2$",
            r"Г) $2$",
            r"Д) $0$"
        ],
        "matches": [
            (r"1. $y = |x - 3| - 5$", r"А) $-5$"),
            (r"2. $y = (x + 1)^2 + 2$", r"Г) $2$"),
            (r"3. $y = |x + 2|$", r"Д) $0$")
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "6. Лінійні рівняння. Лінійні рівняння з модулем"]
    },
    {
        "type": "SHORT",
        "difficulty": 2,
        "text": r"Знайдіть суму нулів функції $y = |x + 2| - 7$.",
        "svg_code": "",
        "answer": "-4",
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "6. Лінійні рівняння. Лінійні рівняння з модулем"]
    },
    {
        "type": "SHORT",
        "difficulty": 2,
        "text": r"Знайдіть найменше значення функції $y = (x - 3)^2 - 8$.",
        "svg_code": "",
        "answer": "-8",
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "12. Квадратична функція"]
    },
    {
        "type": "SHORT",
        "difficulty": 3,
        "text": r"Точка $(4; 3)$ належить графіку функції $y = f(x)$. Знайдіть ординату точки графіка функції $y = -2f(x + 1) + 5$, абсциса якої дорівнює $3$.",
        "svg_code": "",
        "answer": "-1",
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "11. Функції та їх властивості"]
    }
]
