TOPIC_NAME = "32. Рівнобедрений трикутник"
TASKS = [
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть кут при основі, якщо кут при вершині рівнобедреного трикутника дорівнює $40^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $50^\circ$", False),
            (r"Б) $70^\circ$", True),
            (r"В) $80^\circ$", False),
            (r"Г) $140^\circ$", False),
            (r"Д) $40^\circ$", False)
        ],
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть кут при основі, якщо кут при вершині рівнобедреного трикутника дорівнює $64^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $116^\circ$", False),
            (r"Б) $26^\circ$", False),
            (r"В) $64^\circ$", False),
            (r"Г) $58^\circ$", True),
            (r"Д) $68^\circ$", False)
        ],
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть кут при основі, якщо кут при вершині рівнобедреного трикутника дорівнює $120^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $-30^\circ$", False),
            (r"Б) $120^\circ$", False),
            (r"В) $40^\circ$", False),
            (r"Г) $30^\circ$", True),
            (r"Д) $60^\circ$", False)
        ],
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "SHORT",
        "difficulty": 1,
        "text": r"Знайдіть кут при основі, якщо кут при вершині рівнобедреного трикутника дорівнює $88^\circ$.",
        "svg_code": "",
        "answer": "46",
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть кут при вершині, якщо кут при основі рівнобедреного трикутника дорівнює $50^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $80^\circ$", True),
            (r"Б) $130^\circ$", False),
            (r"В) $40^\circ$", False),
            (r"Г) $100^\circ$", False),
            (r"Д) $90^\circ$", False)
        ],
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть кут при вершині, якщо кут при основі рівнобедреного трикутника дорівнює $70^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $50^\circ$", False),
            (r"Б) $20^\circ$", False),
            (r"В) $40^\circ$", True),
            (r"Г) $110^\circ$", False),
            (r"Д) $140^\circ$", False)
        ],
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть кут при вершині, якщо кут при основі рівнобедреного трикутника дорівнює $80^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $20^\circ$", True),
            (r"Б) $30^\circ$", False),
            (r"В) $160^\circ$", False),
            (r"Г) $100^\circ$", False),
            (r"Д) $10^\circ$", False)
        ],
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть периметр, якщо основа рівнобедреного трикутника дорівнює $8$ см, а бічна сторона — $11$ см.",
        "svg_code": "",
        "options": [
            (r"А) $27$", False),
            (r"Б) $19$", False),
            (r"В) $38$", False),
            (r"Г) $41$", False),
            (r"Д) $30$", True)
        ],
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть периметр, якщо основа рівнобедреного трикутника дорівнює $6$ см, а бічна сторона — $9$ см.",
        "svg_code": "",
        "options": [
            (r"А) $33$", False),
            (r"Б) $15$", False),
            (r"В) $21$", False),
            (r"Г) $30$", False),
            (r"Д) $24$", True)
        ],
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть периметр, якщо основа рівнобедреного трикутника дорівнює $14$ см, а бічна сторона — $20$ см.",
        "svg_code": "",
        "options": [
            (r"А) $48$", False),
            (r"Б) $54$", True),
            (r"В) $74$", False),
            (r"Г) $34$", False),
            (r"Д) $68$", False)
        ],
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть периметр, якщо основа рівнобедреного трикутника дорівнює $5$ см, а бічна сторона — $12$ см.",
        "svg_code": "",
        "options": [
            (r"А) $34$", False),
            (r"Б) $22$", False),
            (r"В) $41$", False),
            (r"Г) $29$", True),
            (r"Д) $17$", False)
        ],
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть бічну сторону, якщо периметр рівнобедреного трикутника дорівнює $50$ см, а основа — $16$ см.",
        "svg_code": "",
        "options": [
            (r"А) $17$", True),
            (r"Б) $\frac{50}{3}$", False),
            (r"В) $9$", False),
            (r"Г) $19$", False),
            (r"Д) $34$", False)
        ],
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть бічну сторону, якщо периметр рівнобедреного трикутника дорівнює $28$ см, а основа — $8$ см.",
        "svg_code": "",
        "options": [
            (r"А) $6$", False),
            (r"Б) $20$", False),
            (r"В) $12$", False),
            (r"Г) $\frac{28}{3}$", False),
            (r"Д) $10$", True)
        ],
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть висоту, проведену до основи, якщо бічна сторона рівнобедреного трикутника дорівнює $13$ см, а основа — $10$ см.",
        "svg_code": "",
        "options": [
            (r"А) $11$", False),
            (r"Б) $5$", False),
            (r"В) $8$", False),
            (r"Г) $13$", False),
            (r"Д) $12$", True)
        ],
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть висоту, проведену до основи, якщо бічна сторона рівнобедреного трикутника дорівнює $5$ см, а основа — $6$ см.",
        "svg_code": "",
        "options": [
            (r"А) $4$", True),
            (r"Б) $2$", False),
            (r"В) $5$", False),
            (r"Г) $6$", False),
            (r"Д) $3$", False)
        ],
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть висоту, проведену до основи, якщо бічна сторона рівнобедреного трикутника дорівнює $17$ см, а основа — $16$ см.",
        "svg_code": "",
        "options": [
            (r"А) $9$", False),
            (r"Б) $17$", False),
            (r"В) $16$", False),
            (r"Г) $15$", True),
            (r"Д) $14$", False)
        ],
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть площу, якщо бічна сторона рівнобедреного трикутника дорівнює $13$ см, а основа — $10$ см.",
        "svg_code": "",
        "options": [
            (r"А) $120$", False),
            (r"Б) $130$", False),
            (r"В) $60$", True),
            (r"Г) $65$", False),
            (r"Д) $70$", False)
        ],
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть площу, якщо бічна сторона рівнобедреного трикутника дорівнює $5$ см, а основа — $6$ см.",
        "svg_code": "",
        "options": [
            (r"А) $15$", False),
            (r"Б) $18$", False),
            (r"В) $30$", False),
            (r"Г) $12$", True),
            (r"Д) $24$", False)
        ],
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть площу, якщо бічна сторона рівнобедреного трикутника дорівнює $17$ см, а основа — $16$ см.",
        "svg_code": "",
        "options": [
            (r"А) $136$", False),
            (r"Б) $272$", False),
            (r"В) $120$", True),
            (r"Г) $\frac{255}{2}$", False),
            (r"Д) $240$", False)
        ],
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "SHORT",
        "difficulty": 3,
        "text": r"Знайдіть площу, якщо бічна сторона рівнобедреного трикутника дорівнює $25$ см, а основа — $14$ см.",
        "svg_code": "",
        "answer": "168",
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть його сторону, якщо периметр рівностороннього трикутника дорівнює $27$ см.",
        "svg_code": "",
        "options": [
            (r"А) $10$", False),
            (r"Б) $\frac{27}{2}$", False),
            (r"В) $27$", False),
            (r"Г) $81$", False),
            (r"Д) $9$", True)
        ],
        "topic_tags": ["32. Рівнобедрений трикутник"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть його сторону, якщо периметр рівностороннього трикутника дорівнює $60$ см.",
        "svg_code": "",
        "options": [
            (r"А) $21$", False),
            (r"Б) $60$", False),
            (r"В) $20$", True),
            (r"Г) $30$", False),
            (r"Д) $180$", False)
        ],
        "topic_tags": ["32. Рівнобедрений трикутник"]
    }
]
