TOPIC_NAME = "40. Призма"
TASKS = [
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть об'єм призми, якщо основа прямої призми — прямокутник зі сторонами $3$ см і $4$ см, висота призми — $5$ см.",
        "svg_code": "",
        "options": [
            (r"А) $70$", False),
            (r"Б) $63$", False),
            (r"В) $17$", False),
            (r"Г) $20$", False),
            (r"Д) $60$", True)
        ],
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть об'єм призми, якщо основа прямої призми — прямокутник зі сторонами $5$ см і $5$ см, висота призми — $4$ см.",
        "svg_code": "",
        "options": [
            (r"А) $80$", False),
            (r"Б) $29$", False),
            (r"В) $100$", True),
            (r"Г) $105$", False),
            (r"Д) $\frac{100}{3}$", False)
        ],
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть об'єм призми, якщо основа прямої призми — прямокутник зі сторонами $7$ см і $4$ см, висота призми — $2$ см.",
        "svg_code": "",
        "options": [
            (r"А) $56$", True),
            (r"Б) $63$", False),
            (r"В) $\frac{56}{3}$", False),
            (r"Г) $30$", False),
            (r"Д) $44$", False)
        ],
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "SHORT",
        "difficulty": 1,
        "text": r"Знайдіть об'єм призми, якщо основа прямої призми — прямокутник зі сторонами $9$ см і $2$ см, висота призми — $5$ см.",
        "svg_code": "",
        "answer": "90",
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть об'єм призми, якщо основа прямої призми — прямокутний трикутник із катетами $6$ см і $8$ см, висота призми — $5$ см.",
        "svg_code": "",
        "options": [
            (r"А) $48$", False),
            (r"Б) $126$", False),
            (r"В) $240$", False),
            (r"Г) $120$", True),
            (r"Д) $80$", False)
        ],
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть об'єм призми, якщо основа прямої призми — прямокутний трикутник із катетами $9$ см і $4$ см, висота призми — $7$ см.",
        "svg_code": "",
        "options": [
            (r"А) $135$", False),
            (r"Б) $36$", False),
            (r"В) $126$", True),
            (r"Г) $252$", False),
            (r"Д) $84$", False)
        ],
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть об'єм призми, якщо основа прямої призми — прямокутний трикутник із катетами $8$ см і $6$ см, висота призми — $3$ см.",
        "svg_code": "",
        "options": [
            (r"А) $72$", True),
            (r"Б) $80$", False),
            (r"В) $144$", False),
            (r"Г) $48$", False),
            (r"Д) $27$", False)
        ],
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "SHORT",
        "difficulty": 2,
        "text": r"Знайдіть об'єм призми, якщо основа прямої призми — прямокутний трикутник із катетами $10$ см і $4$ см, висота призми — $5$ см.",
        "svg_code": "",
        "answer": "100",
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть площу бічної поверхні призми, якщо основа прямої призми — прямокутник зі сторонами $6$ см і $2$ см, висота призми — $7$ см.",
        "svg_code": "",
        "options": [
            (r"А) $24$", False),
            (r"Б) $112$", True),
            (r"В) $84$", False),
            (r"Г) $56$", False),
            (r"Д) $136$", False)
        ],
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть площу бічної поверхні призми, якщо основа прямої призми — прямокутник зі сторонами $8$ см і $3$ см, висота призми — $6$ см.",
        "svg_code": "",
        "options": [
            (r"А) $180$", False),
            (r"Б) $132$", True),
            (r"В) $144$", False),
            (r"Г) $66$", False),
            (r"Д) $48$", False)
        ],
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть площу повної поверхні призми, якщо основа прямої призми — прямокутник зі сторонами $6$ см і $2$ см, висота призми — $7$ см.",
        "svg_code": "",
        "options": [
            (r"А) $136$", True),
            (r"Б) $142$", False),
            (r"В) $124$", False),
            (r"Г) $112$", False),
            (r"Д) $84$", False)
        ],
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть діагональ призми, якщо сторона основи правильної чотирикутної призми дорівнює $2$ см, а висота — $1$ см.",
        "svg_code": "",
        "options": [
            (r"А) $5$", False),
            (r"Б) $2$", False),
            (r"В) $1$", False),
            (r"Г) $4$", False),
            (r"Д) $3$", True)
        ],
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть діагональ призми, якщо сторона основи правильної чотирикутної призми дорівнює $4$ см, а висота — $2$ см.",
        "svg_code": "",
        "options": [
            (r"А) $8$", False),
            (r"Б) $7$", False),
            (r"В) $6$", True),
            (r"Г) $5$", False),
            (r"Д) $18$", False)
        ],
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть діагональ призми, якщо сторона основи правильної чотирикутної призми дорівнює $6$ см, а висота — $3$ см.",
        "svg_code": "",
        "options": [
            (r"А) $10$", False),
            (r"Б) $39$", False),
            (r"В) $8$", False),
            (r"Г) $9$", True),
            (r"Д) $11$", False)
        ],
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть її об'єм, якщо правильна чотирикутна призма має сторону основи $4$ см і висоту $5$ см.",
        "svg_code": "",
        "options": [
            (r"А) $20$", False),
            (r"Б) $75$", False),
            (r"В) $80$", True),
            (r"Г) $84$", False),
            (r"Д) $112$", False)
        ],
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть її об'єм, якщо правильна чотирикутна призма має сторону основи $5$ см і висоту $9$ см.",
        "svg_code": "",
        "options": [
            (r"А) $230$", False),
            (r"Б) $45$", False),
            (r"В) $216$", False),
            (r"Г) $180$", False),
            (r"Д) $225$", True)
        ],
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Скільки ребер має $5$-кутна призма?",
        "svg_code": "",
        "options": [
            (r"А) $16$", False),
            (r"Б) $12$", False),
            (r"В) $7$", False),
            (r"Г) $15$", True),
            (r"Д) $10$", False)
        ],
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Скільки ребер має $6$-кутна призма?",
        "svg_code": "",
        "options": [
            (r"А) $12$", False),
            (r"Б) $19$", False),
            (r"В) $18$", True),
            (r"Г) $8$", False),
            (r"Д) $14$", False)
        ],
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Скільки граней має $4$-кутна призма?",
        "svg_code": "",
        "options": [
            (r"А) $6$", True),
            (r"Б) $8$", False),
            (r"В) $4$", False),
            (r"Г) $5$", False),
            (r"Д) $12$", False)
        ],
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Скільки граней має $9$-кутна призма?",
        "svg_code": "",
        "options": [
            (r"А) $10$", False),
            (r"Б) $27$", False),
            (r"В) $18$", False),
            (r"Г) $11$", True),
            (r"Д) $9$", False)
        ],
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть висоту призми, якщо площа бічної поверхні прямої призми дорівнює $84$ см², а периметр основи — $12$ см.",
        "svg_code": "",
        "options": [
            (r"А) $7$", True),
            (r"Б) $8$", False),
            (r"В) $1008$", False),
            (r"Г) $\frac{1}{7}$", False),
            (r"Д) $\frac{7}{2}$", False)
        ],
        "topic_tags": ["40. Призма"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть висоту призми, якщо площа бічної поверхні прямої призми дорівнює $96$ см², а периметр основи — $16$ см.",
        "svg_code": "",
        "options": [
            (r"А) $1536$", False),
            (r"Б) $6$", True),
            (r"В) $3$", False),
            (r"Г) $\frac{1}{6}$", False),
            (r"Д) $7$", False)
        ],
        "topic_tags": ["40. Призма"]
    }
]
