TOPIC_NAME = "41. Піраміда"
TASKS = [
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть об'єм піраміди, якщо основа піраміди — квадрат зі стороною $6$ см, а висота піраміди — $5$ см.",
        "svg_code": "",
        "options": [
            (r"А) $180$", False),
            (r"Б) $90$", False),
            (r"В) $10$", False),
            (r"Г) $60$", True),
            (r"Д) $66$", False)
        ],
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть об'єм піраміди, якщо основа піраміди — квадрат зі стороною $9$ см, а висота піраміди — $4$ см.",
        "svg_code": "",
        "options": [
            (r"А) $324$", False),
            (r"Б) $12$", False),
            (r"В) $108$", True),
            (r"Г) $162$", False),
            (r"Д) $117$", False)
        ],
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть об'єм піраміди, якщо основа піраміди — квадрат зі стороною $12$ см, а висота піраміди — $2$ см.",
        "svg_code": "",
        "options": [
            (r"А) $144$", False),
            (r"Б) $8$", False),
            (r"В) $288$", False),
            (r"Г) $96$", True),
            (r"Д) $108$", False)
        ],
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "SHORT",
        "difficulty": 1,
        "text": r"Знайдіть об'єм піраміди, якщо основа піраміди — квадрат зі стороною $9$ см, а висота піраміди — $5$ см.",
        "svg_code": "",
        "answer": "135",
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть апофему (висоту бічної грані), якщо правильна чотирикутна піраміда має сторону основи $6$ см і висоту $4$ см.",
        "svg_code": "",
        "options": [
            (r"А) $6$", False),
            (r"Б) $3$", False),
            (r"В) $7$", False),
            (r"Г) $4$", False),
            (r"Д) $5$", True)
        ],
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть апофему (висоту бічної грані), якщо правильна чотирикутна піраміда має сторону основи $8$ см і висоту $3$ см.",
        "svg_code": "",
        "options": [
            (r"А) $5$", True),
            (r"Б) $6$", False),
            (r"В) $3$", False),
            (r"Г) $7$", False),
            (r"Д) $4$", False)
        ],
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть апофему (висоту бічної грані), якщо правильна чотирикутна піраміда має сторону основи $16$ см і висоту $15$ см.",
        "svg_code": "",
        "options": [
            (r"А) $18$", False),
            (r"Б) $16$", False),
            (r"В) $23$", False),
            (r"Г) $15$", False),
            (r"Д) $17$", True)
        ],
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть апофему (висоту бічної грані), якщо правильна чотирикутна піраміда має сторону основи $12$ см і висоту $8$ см.",
        "svg_code": "",
        "options": [
            (r"А) $9$", False),
            (r"Б) $14$", False),
            (r"В) $11$", False),
            (r"Г) $8$", False),
            (r"Д) $10$", True)
        ],
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "SHORT",
        "difficulty": 2,
        "text": r"Знайдіть апофему (висоту бічної грані), якщо правильна чотирикутна піраміда має сторону основи $14$ см і висоту $24$ см.",
        "svg_code": "",
        "answer": "25",
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть площу бічної поверхні, якщо правильна чотирикутна піраміда має сторону основи $10$ см і висоту $12$ см.",
        "svg_code": "",
        "options": [
            (r"А) $230$", False),
            (r"Б) $130$", False),
            (r"В) $360$", False),
            (r"Г) $260$", True),
            (r"Д) $340$", False)
        ],
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть площу бічної поверхні, якщо правильна чотирикутна піраміда має сторону основи $16$ см і висоту $15$ см.",
        "svg_code": "",
        "options": [
            (r"А) $736$", False),
            (r"Б) $272$", False),
            (r"В) $544$", True),
            (r"Г) $800$", False),
            (r"Д) $528$", False)
        ],
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть площу повної поверхні, якщо правильна чотирикутна піраміда має сторону основи $6$ см і висоту $4$ см.",
        "svg_code": "",
        "options": [
            (r"А) $36$", False),
            (r"Б) $96$", True),
            (r"В) $72$", False),
            (r"Г) $102$", False),
            (r"Д) $60$", False)
        ],
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть площу повної поверхні, якщо правильна чотирикутна піраміда має сторону основи $10$ см і висоту $12$ см.",
        "svg_code": "",
        "options": [
            (r"А) $260$", False),
            (r"Б) $360$", True),
            (r"В) $100$", False),
            (r"Г) $280$", False),
            (r"Д) $370$", False)
        ],
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть площу повної поверхні, якщо правильна чотирикутна піраміда має сторону основи $16$ см і висоту $15$ см.",
        "svg_code": "",
        "options": [
            (r"А) $800$", True),
            (r"Б) $544$", False),
            (r"В) $576$", False),
            (r"Г) $256$", False),
            (r"Д) $816$", False)
        ],
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Скільки ребер має $4$-кутна піраміда?",
        "svg_code": "",
        "options": [
            (r"А) $8$", True),
            (r"Б) $12$", False),
            (r"В) $4$", False),
            (r"Г) $5$", False),
            (r"Д) $9$", False)
        ],
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Скільки ребер має $8$-кутна піраміда?",
        "svg_code": "",
        "options": [
            (r"А) $16$", True),
            (r"Б) $9$", False),
            (r"В) $24$", False),
            (r"Г) $17$", False),
            (r"Д) $8$", False)
        ],
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Скільки граней (враховуючи основу) має $5$-кутна піраміда?",
        "svg_code": "",
        "options": [
            (r"А) $7$", False),
            (r"Б) $5$", False),
            (r"В) $6$", True),
            (r"Г) $8$", False),
            (r"Д) $10$", False)
        ],
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Скільки граней (враховуючи основу) має $7$-кутна піраміда?",
        "svg_code": "",
        "options": [
            (r"А) $10$", False),
            (r"Б) $9$", False),
            (r"В) $7$", False),
            (r"Г) $8$", True),
            (r"Д) $14$", False)
        ],
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть висоту піраміди, якщо площа основи піраміди дорівнює $27$ см², а об'єм — $45$ см³.",
        "svg_code": "",
        "options": [
            (r"А) $\frac{5}{3}$", False),
            (r"Б) $15$", False),
            (r"В) $6$", False),
            (r"Г) $5$", True),
            (r"Д) $8$", False)
        ],
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть висоту піраміди, якщо площа основи піраміди дорівнює $45$ см², а об'єм — $60$ см³.",
        "svg_code": "",
        "options": [
            (r"А) $5$", False),
            (r"Б) $12$", False),
            (r"В) $\frac{4}{3}$", False),
            (r"Г) $7$", False),
            (r"Д) $4$", True)
        ],
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть бічне ребро, якщо основа правильної чотирикутної піраміди — квадрат зі стороною $8$ см, висота піраміди — $2$ см.",
        "svg_code": "",
        "options": [
            (r"А) $5$", False),
            (r"Б) $2$", False),
            (r"В) $6$", True),
            (r"Г) $7$", False),
            (r"Д) $8$", False)
        ],
        "topic_tags": ["41. Піраміда"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть бічне ребро, якщо основа правильної чотирикутної піраміди — квадрат зі стороною $12$ см, висота піраміди — $3$ см.",
        "svg_code": "",
        "options": [
            (r"А) $10$", False),
            (r"Б) $3$", False),
            (r"В) $8$", False),
            (r"Г) $9$", True),
            (r"Д) $12$", False)
        ],
        "topic_tags": ["41. Піраміда"]
    }
]
