TOPIC_NAME = "24. Побудова графіків функцій шляхом геометричних перетворень"
TASKS = [
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Графік функції $y = x^2$ перенесли на $3$ одиниці вправо та на $2$ одиниці вгору. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = (x-2)^2+3$", False),
            (r"Б) $y = (x+3)^2-2$", False),
            (r"В) $y = (x-3)^2-2$", False),
            (r"Г) $y = (x+3)^2+2$", False),
            (r"Д) $y = (x-3)^2+2$", True)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "12. Квадратична функція"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Графік функції $y = |x|$ перенесли на $4$ одиниці вліво та на $1$ одиницю вниз. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = |x+4|-1$", True),
            (r"Б) $y = |x-4|+1$", False),
            (r"В) $y = |x-4|-1$", False),
            (r"Г) $y = |x+1|-4$", False),
            (r"Д) $y = |x+4|+1$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "6. Лінійні рівняння. Лінійні рівняння з модулем"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Графік функції $y = \sqrt{x}$ перенесли на $2$ одиниці вправо та на $5$ одиниць вниз. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = \sqrt{x+2}+5$", False),
            (r"Б) $y = \sqrt{x-2}+5$", False),
            (r"В) $y = \sqrt{x+5}+2$", False),
            (r"Г) $y = \sqrt{x+2}-5$", False),
            (r"Д) $y = \sqrt{x-2}-5$", True)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "9. Корені та їх властивості"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Графік функції $y = \frac{1}{x}$ перенесли на $3$ одиниці вліво та на $4$ одиниці вгору. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = \frac{1}{x-3}-4$", False),
            (r"Б) $y = \frac{1}{x-3}+4$", False),
            (r"В) $y = \frac{1}{x+3}-4$", False),
            (r"Г) $y = \frac{1}{x+3}+4$", True),
            (r"Д) $y = \frac{1}{x-4}-3$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "11. Функції та їх властивості"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Графік функції $y = 2^x$ перенесли на $1$ одиницю вправо та на $3$ одиниці вниз. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = 2^{x+1}-3$", False),
            (r"Б) $y = 2^{x+1}+3$", False),
            (r"В) $y = 2^{x+3}+1$", False),
            (r"Г) $y = 2^{x-1}+3$", False),
            (r"Д) $y = 2^{x-1}-3$", True)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "19. Показникові вирази"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Графік функції $y = x^2$ перенесли на $5$ одиниць вліво та на $3$ одиниці вниз. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = (x-5)^2-3$", False),
            (r"Б) $y = (x+3)^2-5$", False),
            (r"В) $y = (x+5)^2+3$", False),
            (r"Г) $y = (x-5)^2+3$", False),
            (r"Д) $y = (x+5)^2-3$", True)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "12. Квадратична функція"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Графік функції $y = 2^x + 1$ симетрично відобразили відносно осі $Oy$. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = -2^x - 1$", False),
            (r"Б) $y = 2^{-x} + 1$", True),
            (r"В) $y = 2^{-x} - 1$", False),
            (r"Г) $y = 2^x - 1$", False),
            (r"Д) $y = -2^{-x} - 1$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "19. Показникові вирази"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Графік функції $y = \sqrt{x + 2}$ симетрично відобразили відносно осі $Oy$. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = \sqrt{x - 2}$", False),
            (r"Б) $y = \sqrt{2 - x}$", True),
            (r"В) $y = -\sqrt{x + 2}$", False),
            (r"Г) $y = -\sqrt{2 - x}$", False),
            (r"Д) $y = \sqrt{-x} + 2$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "9. Корені та їх властивості"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Графік функції $y = x^2 + x$ симетрично відобразили відносно початку координат. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = -x^2 + x$", True),
            (r"Б) $y = x^2 - x$", False),
            (r"В) $y = -x^2 + 1$", False),
            (r"Г) $y = -x^2 - x$", False),
            (r"Д) $y = x^2 + x$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "12. Квадратична функція"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Графік функції $y = |x - 1| + 2$ симетрично відобразили відносно осі $Ox$. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = -|x + 1| - 2$", False),
            (r"Б) $y = -|x - 1| + 2$", False),
            (r"В) $y = -|x - 1| - 2$", True),
            (r"Г) $y = |x + 1| + 2$", False),
            (r"Д) $y = |x - 1| - 2$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "6. Лінійні рівняння. Лінійні рівняння з модулем"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Графік функції $y = f(x)$ розтягнули від осі $Ox$ у $3$ рази. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = \frac{1}{3}f(x)$", False),
            (r"Б) $y = f(3x)$", False),
            (r"В) $y = f\left(\frac{x}{3}\right)$", False),
            (r"Г) $y = 3f(x)$", True),
            (r"Д) $y = f(x) + 3$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "11. Функції та їх властивості"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Графік функції $y = f(x)$ стиснули до осі $Oy$ у $2$ рази. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = f\left(\frac{x}{2}\right)$", False),
            (r"Б) $y = f(x - 2)$", False),
            (r"В) $y = \frac{1}{2}f(x)$", False),
            (r"Г) $y = 2f(x)$", False),
            (r"Д) $y = f(2x)$", True)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "11. Функції та їх властивості"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Графік функції $y = f(x)$ розтягнули від осі $Oy$ у $4$ рази. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = f\left(\frac{x}{4}\right)$", True),
            (r"Б) $y = \frac{1}{4}f(x)$", False),
            (r"В) $y = f(x) - 4$", False),
            (r"Г) $y = 4f(x)$", False),
            (r"Д) $y = f(4x)$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "11. Функції та їх властивості"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Графік функції $y = f(x)$ стиснули до осі $Ox$ у $5$ разів. Яка формула задає отриманий графік?",
        "svg_code": "",
        "options": [
            (r"А) $y = \frac{1}{5}f(x)$", True),
            (r"Б) $y = f(5x)$", False),
            (r"В) $y = 5f(x)$", False),
            (r"Г) $y = f(x) - 5$", False),
            (r"Д) $y = f\left(\frac{x}{5}\right)$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "11. Функції та їх властивості"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Як із графіка функції $y = f(x)$ побудувати графік функції $y = |f(x)|$?",
        "svg_code": "",
        "options": [
            (r"А) Частину графіка, що лежить вище осі $Ox$, симетрично відобразити відносно осі $Ox$, решту залишити без змін", False),
            (r"Б) Увесь графік симетрично відобразити відносно осі $Ox$", False),
            (r"В) Частину графіка, що лежить ліворуч від осі $Oy$, відкинути, а праву частину відобразити відносно осі $Oy$", False),
            (r"Г) Частину графіка, що лежить нижче осі $Ox$, симетрично відобразити відносно осі $Ox$, решту залишити без змін", True),
            (r"Д) Увесь графік перенести вгору на $1$ одиницю", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "6. Лінійні рівняння. Лінійні рівняння з модулем"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Як із графіка функції $y = f(x)$ побудувати графік функції $y = f(|x|)$?",
        "svg_code": "",
        "options": [
            (r"А) Увесь графік симетрично відобразити відносно початку координат", False),
            (r"Б) Частину графіка, що лежить нижче осі $Ox$, симетрично відобразити відносно осі $Ox$, решту залишити без змін", False),
            (r"В) Частину графіка, що лежить праворуч від осі $Oy$, відкинути, а ліву частину залишити без змін", False),
            (r"Г) Увесь графік симетрично відобразити відносно осі $Oy$", False),
            (r"Д) Частину графіка, що лежить ліворуч від осі $Oy$, відкинути, а праву частину симетрично відобразити відносно осі $Oy$", True)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "6. Лінійні рівняння. Лінійні рівняння з модулем"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Графік якої функції можна отримати з графіка функції $y = x^2$ симетричним відображенням відносно осі $Ox$ та перенесенням на $2$ одиниці вгору?",
        "svg_code": "",
        "options": [
            (r"А) $y = -(x + 2)^2$", False),
            (r"Б) $y = -x^2 - 2$", False),
            (r"В) $y = -x^2 + 2$", True),
            (r"Г) $y = x^2 - 2$", False),
            (r"Д) $y = (x - 2)^2$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "12. Квадратична функція"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть координати вершини параболи $y = (x + 3)^2 - 5$.",
        "svg_code": "",
        "options": [
            (r"А) $(3; -5)$", False),
            (r"Б) $(-3; 5)$", False),
            (r"В) $(3; 5)$", False),
            (r"Г) $(-3; -5)$", True),
            (r"Д) $(-5; -3)$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "12. Квадратична функція"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть координати вершини параболи $y = -2(x - 1)^2 + 4$.",
        "svg_code": "",
        "options": [
            (r"А) $(-1; -4)$", False),
            (r"Б) $(-1; 4)$", False),
            (r"В) $(4; 1)$", False),
            (r"Г) $(1; -4)$", False),
            (r"Д) $(1; 4)$", True)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "12. Квадратична функція"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть координати вершини параболи $y = x^2 - 8x + 3$.",
        "svg_code": "",
        "options": [
            (r"А) $(-4; -13)$", False),
            (r"Б) $(-13; 4)$", False),
            (r"В) $(4; -13)$", True),
            (r"Г) $(-4; 13)$", False),
            (r"Д) $(4; 13)$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "12. Квадратична функція"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Укажіть область значень функції $y = \sqrt{x - 3} + 2$.",
        "svg_code": "",
        "options": [
            (r"А) $[2; +\infty)$", True),
            (r"Б) $(2; +\infty)$", False),
            (r"В) $[3; +\infty)$", False),
            (r"Г) $[-2; +\infty)$", False),
            (r"Д) $(-\infty; 2]$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "9. Корені та їх властивості"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Яке найменше значення має функція $y = |x + 2| - 3$?",
        "svg_code": "",
        "options": [
            (r"А) $3$", False),
            (r"Б) $-2$", False),
            (r"В) $2$", False),
            (r"Г) $-3$", True),
            (r"Д) $0$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "6. Лінійні рівняння. Лінійні рівняння з модулем"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Укажіть область значень функції $y = \frac{1}{x - 4} + 1$.",
        "svg_code": "",
        "options": [
            (r"А) $(-\infty; -1) \cup (-1; +\infty)$", False),
            (r"Б) $[1; +\infty)$", False),
            (r"В) $(-\infty; 1) \cup (1; +\infty)$", True),
            (r"Г) $(-\infty; +\infty)$", False),
            (r"Д) $(-\infty; 4) \cup (4; +\infty)$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "11. Функції та їх властивості"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Точка $A(2; 5)$ належить графіку функції $y = f(x)$. Яка з точок обов'язково належить графіку функції $y = f(x - 3) + 1$?",
        "svg_code": "",
        "options": [
            (r"А) $(2; 5)$", False),
            (r"Б) $(5; 4)$", False),
            (r"В) $(5; 6)$", True),
            (r"Г) $(-1; 4)$", False),
            (r"Д) $(-1; 6)$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "11. Функції та їх властивості"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Точка $B(-1; 4)$ належить графіку функції $y = f(x)$. Яка з точок обов'язково належить графіку функції $y = -f(x + 2)$?",
        "svg_code": "",
        "options": [
            (r"А) $(-3; -4)$", True),
            (r"Б) $(-3; 4)$", False),
            (r"В) $(-1; -4)$", False),
            (r"Г) $(1; -4)$", False),
            (r"Д) $(1; 4)$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "11. Функції та їх властивості"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Точка $C(3; -2)$ належить графіку функції $y = f(x)$. Яка з точок обов'язково належить графіку функції $y = f(-x) + 2$?",
        "svg_code": "",
        "options": [
            (r"А) $(-3; -4)$", False),
            (r"Б) $(3; -4)$", False),
            (r"В) $(-3; 0)$", True),
            (r"Г) $(3; 0)$", False),
            (r"Д) $(-3; -2)$", False)
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "11. Функції та їх властивості"]
    },
    {
        "type": "MATCH",
        "difficulty": 1,
        "text": r"Узгодьте функцію (1–3) із перетворенням графіка функції $y = |x|$ (А–Д), яким її можна отримати.",
        "svg_code": "",
        "options": [
            r"А) Перенесення вправо на $2$ одиниці",
            r"Б) Перенесення вліво на $2$ одиниці",
            r"В) Перенесення вгору на $2$ одиниці",
            r"Г) Перенесення вниз на $2$ одиниці",
            r"Д) Симетричне відображення відносно осі $Ox$"
        ],
        "matches": [
            (r"1. $y = |x - 2|$", r"А) Перенесення вправо на $2$ одиниці"),
            (r"2. $y = |x| - 2$", r"Г) Перенесення вниз на $2$ одиниці"),
            (r"3. $y = |x + 2|$", r"Б) Перенесення вліво на $2$ одиниці")
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "6. Лінійні рівняння. Лінійні рівняння з модулем"]
    },
    {
        "type": "MATCH",
        "difficulty": 2,
        "text": r"Узгодьте функцію (1–3) із координатами вершини її графіка (А–Д).",
        "svg_code": "",
        "options": [
            r"А) $(1; 2)$",
            r"Б) $(-1; 2)$",
            r"В) $(-1; -2)$",
            r"Г) $(1; -2)$",
            r"Д) $(2; 1)$"
        ],
        "matches": [
            (r"1. $y = (x - 1)^2 + 2$", r"А) $(1; 2)$"),
            (r"2. $y = -(x + 1)^2 + 2$", r"Б) $(-1; 2)$"),
            (r"3. $y = (x + 1)^2 - 2$", r"В) $(-1; -2)$")
        ],
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "12. Квадратична функція"]
    },
    {
        "type": "SHORT",
        "difficulty": 2,
        "text": r"Знайдіть добуток нулів функції $y = |x - 3| - 5$.",
        "svg_code": "",
        "answer": "-16",
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "6. Лінійні рівняння. Лінійні рівняння з модулем"]
    },
    {
        "type": "SHORT",
        "difficulty": 2,
        "text": r"Знайдіть суму координат вершини параболи $y = (x - 4)^2 - 9$.",
        "svg_code": "",
        "answer": "-5",
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "12. Квадратична функція"]
    },
    {
        "type": "SHORT",
        "difficulty": 3,
        "text": r"Точка $(2; 5)$ належить графіку функції $y = f(x)$. Знайдіть ординату точки графіка функції $y = 2f(x - 1) + 3$, абсциса якої дорівнює $3$.",
        "svg_code": "",
        "answer": "13",
        "topic_tags": ["24. Побудова графіків функцій шляхом геометричних перетворень", "11. Функції та їх властивості"]
    }
]
