TOPIC_NAME = "36. Чотирикутники"
TASKS = [
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть площу паралелограма, якщо сторона паралелограма дорівнює $12$ см, а висота, проведена до неї, — $5$ см.",
        "svg_code": "",
        "options": [
            (r"А) $72$", False),
            (r"Б) $60$", True),
            (r"В) $34$", False),
            (r"Г) $30$", False),
            (r"Д) $17$", False)
        ],
        "topic_tags": ["36. Чотирикутники"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть площу паралелограма, якщо сторона паралелограма дорівнює $10$ см, а висота, проведена до неї, — $10$ см.",
        "svg_code": "",
        "options": [
            (r"А) $100$", True),
            (r"Б) $110$", False),
            (r"В) $50$", False),
            (r"Г) $40$", False),
            (r"Д) $20$", False)
        ],
        "topic_tags": ["36. Чотирикутники"]
    },
    {
        "type": "SHORT",
        "difficulty": 1,
        "text": r"Знайдіть площу паралелограма, якщо сторона паралелограма дорівнює $14$ см, а висота, проведена до неї, — $3$ см.",
        "svg_code": "",
        "answer": "42",
        "topic_tags": ["36. Чотирикутники"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть сусідній кут, якщо один із кутів паралелограма дорівнює $125^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $55^\circ$", True),
            (r"Б) $235^\circ$", False),
            (r"В) $35^\circ$", False),
            (r"Г) $65^\circ$", False),
            (r"Д) $125^\circ$", False)
        ],
        "topic_tags": ["36. Чотирикутники"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть площу ромба, якщо діагоналі ромба дорівнюють $6$ см і $8$ см.",
        "svg_code": "",
        "options": [
            (r"А) $12$", False),
            (r"Б) $30$", False),
            (r"В) $48$", False),
            (r"Г) $14$", False),
            (r"Д) $24$", True)
        ],
        "topic_tags": ["36. Чотирикутники"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть площу ромба, якщо діагоналі ромба дорівнюють $30$ см і $16$ см.",
        "svg_code": "",
        "options": [
            (r"А) $270$", False),
            (r"Б) $480$", False),
            (r"В) $46$", False),
            (r"Г) $240$", True),
            (r"Д) $120$", False)
        ],
        "topic_tags": ["36. Чотирикутники"]
    },
    {
        "type": "SHORT",
        "difficulty": 1,
        "text": r"Знайдіть площу ромба, якщо діагоналі ромба дорівнюють $20$ см і $9$ см.",
        "svg_code": "",
        "answer": "90",
        "topic_tags": ["36. Чотирикутники"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть сторону ромба, якщо діагоналі ромба дорівнюють $10$ см і $24$ см.",
        "svg_code": "",
        "options": [
            (r"А) $12$", False),
            (r"Б) $17$", False),
            (r"В) $13$", True),
            (r"Г) $34$", False),
            (r"Д) $14$", False)
        ],
        "topic_tags": ["36. Чотирикутники"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть середню лінію трапеції, якщо основи трапеції дорівнюють $6$ см і $10$ см.",
        "svg_code": "",
        "options": [
            (r"А) $2$", False),
            (r"Б) $30$", False),
            (r"В) $16$", False),
            (r"Г) $4$", False),
            (r"Д) $8$", True)
        ],
        "topic_tags": ["36. Чотирикутники"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть середню лінію трапеції, якщо основи трапеції дорівнюють $4$ см і $13$ см.",
        "svg_code": "",
        "options": [
            (r"А) $17$", False),
            (r"Б) $\frac{9}{2}$", False),
            (r"В) $26$", False),
            (r"Г) $9$", False),
            (r"Д) $\frac{17}{2}$", True)
        ],
        "topic_tags": ["36. Чотирикутники"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть площу трапеції, якщо основи трапеції дорівнюють $9$ см і $15$ см, а висота — $4$ см.",
        "svg_code": "",
        "options": [
            (r"А) $540$", False),
            (r"Б) $96$", False),
            (r"В) $48$", True),
            (r"Г) $33$", False),
            (r"Д) $52$", False)
        ],
        "topic_tags": ["36. Чотирикутники"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть діагональ прямокутника, якщо сторони прямокутника дорівнюють $3$ см і $4$ см.",
        "svg_code": "",
        "options": [
            (r"А) $6$", False),
            (r"Б) $5$", True),
            (r"В) $12$", False),
            (r"Г) $7$", False),
            (r"Д) $1$", False)
        ],
        "topic_tags": ["36. Чотирикутники"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть діагональ прямокутника, якщо сторони прямокутника дорівнюють $7$ см і $24$ см.",
        "svg_code": "",
        "options": [
            (r"А) $31$", False),
            (r"Б) $168$", False),
            (r"В) $17$", False),
            (r"Г) $25$", True),
            (r"Д) $26$", False)
        ],
        "topic_tags": ["36. Чотирикутники"]
    },
    {
        "type": "SHORT",
        "difficulty": 1,
        "text": r"Знайдіть діагональ прямокутника, якщо сторони прямокутника дорівнюють $6$ см і $8$ см.",
        "svg_code": "",
        "answer": "10",
        "topic_tags": ["36. Чотирикутники"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть площу квадрата, якщо діагональ квадрата дорівнює $14$ см.",
        "svg_code": "",
        "options": [
            (r"А) $196$", False),
            (r"Б) $392$", False),
            (r"В) $14$", False),
            (r"Г) $112$", False),
            (r"Д) $98$", True)
        ],
        "topic_tags": ["36. Чотирикутники"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть протилежний кут, якщо чотирикутник вписано в коло, один із його кутів дорівнює $115^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $115^\circ$", False),
            (r"Б) $75^\circ$", False),
            (r"В) $65^\circ$", True),
            (r"Г) $245^\circ$", False),
            (r"Д) $90^\circ$", False)
        ],
        "topic_tags": ["36. Чотирикутники"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть четверту сторону, якщо у чотирикутник вписано коло, три послідовні сторони дорівнюють $4$, $10$ і $8$ см.",
        "svg_code": "",
        "options": [
            (r"А) $2$", True),
            (r"Б) $22$", False),
            (r"В) $4$", False),
            (r"Г) $14$", False),
            (r"Д) $6$", False)
        ],
        "topic_tags": ["36. Чотирикутники"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть квадрат другої діагоналі, якщо у паралелограмі сторони дорівнюють $6$ см і $9$ см, а одна діагональ — $10$ см.",
        "svg_code": "",
        "options": [
            (r"А) $125$", False),
            (r"Б) $350$", False),
            (r"В) $134$", True),
            (r"Г) $17$", False),
            (r"Д) $140$", False)
        ],
        "topic_tags": ["36. Чотирикутники"]
    }
]
