TOPIC_NAME = "30. Найпростіші геометричні фігури"
TASKS = [
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть довжину відрізка $AC$, якщо на прямій лежать точки $A$, $B$, $C$ у такому порядку, $AB = 12$ см, $BC = 9$ см.",
        "svg_code": "",
        "options": [
            (r"А) $108$", False),
            (r"Б) $20$", False),
            (r"В) $21$", True),
            (r"Г) $22$", False),
            (r"Д) $3$", False)
        ],
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть довжину відрізка $AC$, якщо на прямій лежать точки $A$, $B$, $C$ у такому порядку, $AB = 15$ см, $BC = 8$ см.",
        "svg_code": "",
        "options": [
            (r"А) $120$", False),
            (r"Б) $23$", True),
            (r"В) $22$", False),
            (r"Г) $24$", False),
            (r"Д) $7$", False)
        ],
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "SHORT",
        "difficulty": 1,
        "text": r"Знайдіть довжину відрізка $AC$, якщо на прямій лежать точки $A$, $B$, $C$ у такому порядку, $AB = 13$ см, $BC = 17$ см.",
        "svg_code": "",
        "answer": "30",
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть довжину відрізка $AM$, якщо точка $M$ — середина відрізка $AB$, $AB = 14$ см.",
        "svg_code": "",
        "options": [
            (r"А) $\frac{14}{3}$", False),
            (r"Б) $8$", False),
            (r"В) $28$", False),
            (r"Г) $7$", True),
            (r"Д) $14$", False)
        ],
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть довжину відрізка $AM$, якщо точка $M$ — середина відрізка $AB$, $AB = 30$ см.",
        "svg_code": "",
        "options": [
            (r"А) $15$", True),
            (r"Б) $16$", False),
            (r"В) $30$", False),
            (r"Г) $60$", False),
            (r"Д) $10$", False)
        ],
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть довжину відрізка $AM$, якщо точка $M$ лежить на відрізку $AB$, $AM : MB = 2 : 3$, $AB = 20$ см.",
        "svg_code": "",
        "options": [
            (r"А) $4$", False),
            (r"Б) $9$", False),
            (r"В) $18$", False),
            (r"Г) $12$", False),
            (r"Д) $8$", True)
        ],
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть довжину відрізка $AM$, якщо точка $M$ лежить на відрізку $AB$, $AM : MB = 2 : 7$, $AB = 27$ см.",
        "svg_code": "",
        "options": [
            (r"А) $21$", False),
            (r"Б) $6$", True),
            (r"В) $3$", False),
            (r"Г) $25$", False),
            (r"Д) $7$", False)
        ],
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "SHORT",
        "difficulty": 2,
        "text": r"Знайдіть довжину відрізка $AM$, якщо точка $M$ лежить на відрізку $AB$, $AM : MB = 5 : 3$, $AB = 32$ см.",
        "svg_code": "",
        "answer": "20",
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть другий кут, якщо суміжні кути, один із яких дорівнює $40^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $40^\circ$", False),
            (r"Б) $50^\circ$", False),
            (r"В) $140^\circ$", True),
            (r"Г) $150^\circ$", False),
            (r"Д) $320^\circ$", False)
        ],
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть другий кут, якщо суміжні кути, один із яких дорівнює $73^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $73^\circ$", False),
            (r"Б) $287^\circ$", False),
            (r"В) $117^\circ$", False),
            (r"Г) $107^\circ$", True),
            (r"Д) $17^\circ$", False)
        ],
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть другий кут, якщо суміжні кути, один із яких дорівнює $151^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $209^\circ$", False),
            (r"Б) $61^\circ$", False),
            (r"В) $151^\circ$", False),
            (r"Г) $29^\circ$", True),
            (r"Д) $39^\circ$", False)
        ],
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть кут $AOC$, якщо промінь $OC$ — бісектриса кута $AOB$, $\angle AOB = 124^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $62^\circ$", True),
            (r"Б) $248^\circ$", False),
            (r"В) $67^\circ$", False),
            (r"Г) $56^\circ$", False),
            (r"Д) $124^\circ$", False)
        ],
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть кут $AOC$, якщо промінь $OC$ — бісектриса кута $AOB$, $\angle AOB = 36^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $18^\circ$", True),
            (r"Б) $72^\circ$", False),
            (r"В) $23^\circ$", False),
            (r"Г) $144^\circ$", False),
            (r"Д) $36^\circ$", False)
        ],
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть менший кут між годинною та хвилинною стрілками, якщо годинник показує $6$ год $0$ хв.",
        "svg_code": "",
        "options": [
            (r"А) $120^\circ$", False),
            (r"Б) $150^\circ$", False),
            (r"В) $90^\circ$", False),
            (r"Г) $210^\circ$", False),
            (r"Д) $180^\circ$", True)
        ],
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть менший кут між годинною та хвилинною стрілками, якщо годинник показує $4$ год $0$ хв.",
        "svg_code": "",
        "options": [
            (r"А) $150^\circ$", False),
            (r"Б) $120^\circ$", True),
            (r"В) $121^\circ$", False),
            (r"Г) $240^\circ$", False),
            (r"Д) $90^\circ$", False)
        ],
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "SHORT",
        "difficulty": 2,
        "text": r"Знайдіть менший кут між годинною та хвилинною стрілками, якщо годинник показує $5$ год $0$ хв.",
        "svg_code": "",
        "answer": "150",
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Скільки різних прямих можна провести через пари точок, якщо на площині позначено $4$ точок, жодні три з яких не лежать на одній прямій?",
        "svg_code": "",
        "options": [
            (r"А) $4$", False),
            (r"Б) $6$", True),
            (r"В) $10$", False),
            (r"Г) $12$", False),
            (r"Д) $5$", False)
        ],
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Скільки різних прямих можна провести через пари точок, якщо на площині позначено $7$ точок, жодні три з яких не лежать на одній прямій?",
        "svg_code": "",
        "options": [
            (r"А) $21$", True),
            (r"Б) $28$", False),
            (r"В) $42$", False),
            (r"Г) $7$", False),
            (r"Д) $20$", False)
        ],
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Скільки різних кутів утворюється, якщо з однієї точки проведено $5$ променів?",
        "svg_code": "",
        "options": [
            (r"А) $20$", False),
            (r"Б) $5$", False),
            (r"В) $9$", False),
            (r"Г) $11$", False),
            (r"Д) $10$", True)
        ],
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть другий внутрішній односторонній кут, якщо дві паралельні прямі перетнуто січною, один із внутрішніх односторонніх кутів дорівнює $65^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $25^\circ$", False),
            (r"Б) $295^\circ$", False),
            (r"В) $65^\circ$", False),
            (r"Г) $115^\circ$", True),
            (r"Д) $125^\circ$", False)
        ],
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть другий внутрішній односторонній кут, якщо дві паралельні прямі перетнуто січною, один із внутрішніх односторонніх кутів дорівнює $48^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $312^\circ$", False),
            (r"Б) $142^\circ$", False),
            (r"В) $48^\circ$", False),
            (r"Г) $42^\circ$", False),
            (r"Д) $132^\circ$", True)
        ],
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Знайдіть суму двох вертикальних кутів, що не дорівнюють цьому куту, якщо дві прямі перетинаються, один із кутів дорівнює $65^\circ$.",
        "svg_code": "",
        "options": [
            (r"А) $230^\circ$", True),
            (r"Б) $180^\circ$", False),
            (r"В) $295^\circ$", False),
            (r"Г) $130^\circ$", False),
            (r"Д) $115^\circ$", False)
        ],
        "topic_tags": ["30. Найпростіші геометричні фігури"]
    }
]
