TOPIC_NAME = "29. Початки теорії ймовірностей та елементи статистики"
TASKS = [
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"У мішку $3$ червоних і $7$ білих куль. Яка ймовірність навмання витягти червону кулю?",
        "svg_code": "",
        "options": [
            (r"А) $\frac{7}{10}$", False),
            (r"Б) $\frac{3}{10}$", True),
            (r"В) $\frac{1}{10}$", False),
            (r"Г) $\frac{10}{3}$", False),
            (r"Д) $\frac{3}{7}$", False)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"У мішку $2$ червоних і $8$ білих куль. Яка ймовірність навмання витягти червону кулю?",
        "svg_code": "",
        "options": [
            (r"А) $5$", False),
            (r"Б) $\frac{4}{5}$", False),
            (r"В) $\frac{1}{5}$", True),
            (r"Г) $\frac{1}{4}$", False),
            (r"Д) $\frac{1}{10}$", False)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"У мішку $6$ червоних і $9$ білих куль. Яка ймовірність навмання витягти червону кулю?",
        "svg_code": "",
        "options": [
            (r"А) $\frac{1}{15}$", False),
            (r"Б) $\frac{3}{5}$", False),
            (r"В) $\frac{2}{5}$", True),
            (r"Г) $\frac{5}{2}$", False),
            (r"Д) $\frac{2}{3}$", False)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Кидають два кубики. Яка ймовірність того, що сума очок дорівнює $7$?",
        "svg_code": "",
        "options": [
            (r"А) $\frac{1}{6}$", True),
            (r"Б) $\frac{7}{36}$", False),
            (r"В) $\frac{1}{3}$", False),
            (r"Г) $\frac{1}{12}$", False),
            (r"Д) $\frac{7}{12}$", False)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Кидають два кубики. Яка ймовірність того, що сума очок дорівнює $5$?",
        "svg_code": "",
        "options": [
            (r"А) $\frac{5}{12}$", False),
            (r"Б) $\frac{5}{36}$", False),
            (r"В) $\frac{1}{9}$", True),
            (r"Г) $\frac{1}{6}$", False),
            (r"Д) $\frac{1}{12}$", False)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Кидають два кубики. Яка ймовірність того, що сума очок дорівнює $10$?",
        "svg_code": "",
        "options": [
            (r"А) $\frac{1}{6}$", False),
            (r"Б) $\frac{5}{18}$", False),
            (r"В) $\frac{5}{6}$", False),
            (r"Г) $\frac{1}{12}$", True),
            (r"Д) $\frac{13}{12}$", False)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Монету кидають $3$ рази; подія: герб випав рівно $1$ раз. Яка ймовірність цієї події?",
        "svg_code": "",
        "options": [
            (r"А) $\frac{1}{8}$", False),
            (r"Б) $\frac{1}{2}$", False),
            (r"В) $\frac{3}{8}$", True),
            (r"Г) $\frac{1}{3}$", False),
            (r"Д) $\frac{3}{4}$", False)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Монету кидають $3$ рази; подія: герб випав рівно $2$ рази. Яка ймовірність цієї події?",
        "svg_code": "",
        "options": [
            (r"А) $\frac{3}{8}$", True),
            (r"Б) $\frac{2}{3}$", False),
            (r"В) $\frac{1}{2}$", False),
            (r"Г) $\frac{3}{4}$", False),
            (r"Д) $\frac{1}{8}$", False)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "CHOICE",
        "difficulty": 3,
        "text": r"Монету кидають $5$ разів; подія: герб випав рівно $2$ рази. Яка ймовірність цієї події?",
        "svg_code": "",
        "options": [
            (r"А) $\frac{5}{16}$", True),
            (r"Б) $\frac{1}{32}$", False),
            (r"В) $\frac{2}{5}$", False),
            (r"Г) $\frac{5}{8}$", False),
            (r"Д) $\frac{1}{2}$", False)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть моду ряду даних: $2, 4, 4, 6, 9, 11$.",
        "svg_code": "",
        "options": [
            (r"А) $2$", False),
            (r"Б) $11$", False),
            (r"В) $4$", True),
            (r"Г) $6$", False),
            (r"Д) $5$", False)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть моду ряду даних: $8, 8, 9, 12, 13$.",
        "svg_code": "",
        "options": [
            (r"А) $10$", False),
            (r"Б) $8$", True),
            (r"В) $9$", False),
            (r"Г) $13$", False),
            (r"Д) $7$", False)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть моду ряду даних: $10, 12, 12, 15, 16, 20$.",
        "svg_code": "",
        "options": [
            (r"А) $20$", False),
            (r"Б) $12$", True),
            (r"В) $\frac{27}{2}$", False),
            (r"Г) $10$", False),
            (r"Д) $14$", False)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть медіану ряду даних: $2, 4, 4, 6, 9, 11$.",
        "svg_code": "",
        "options": [
            (r"А) $4$", False),
            (r"Б) $5$", True),
            (r"В) $6$", False),
            (r"Г) $11$", False),
            (r"Д) $2$", False)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "CHOICE",
        "difficulty": 2,
        "text": r"Знайдіть медіану ряду даних: $1, 3, 3, 3, 5, 7, 8$.",
        "svg_code": "",
        "options": [
            (r"А) $3$", True),
            (r"Б) $\frac{30}{7}$", False),
            (r"В) $4$", False),
            (r"Г) $1$", False),
            (r"Д) $8$", False)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть середнє арифметичне ряду даних: $2, 4, 6, 8$.",
        "svg_code": "",
        "options": [
            (r"А) $6$", False),
            (r"Б) $2$", False),
            (r"В) $20$", False),
            (r"Г) $8$", False),
            (r"Д) $5$", True)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть середнє арифметичне ряду даних: $1, 2, 3, 4, 5, 15$.",
        "svg_code": "",
        "options": [
            (r"А) $30$", False),
            (r"Б) $5$", True),
            (r"В) $\frac{7}{2}$", False),
            (r"Г) $1$", False),
            (r"Д) $15$", False)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть середнє арифметичне ряду даних: $10, 20, 30$.",
        "svg_code": "",
        "options": [
            (r"А) $60$", False),
            (r"Б) $21$", False),
            (r"В) $10$", False),
            (r"Г) $20$", True),
            (r"Д) $30$", False)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть розмах ряду даних: $3, 5, 5, 7, 10$.",
        "svg_code": "",
        "options": [
            (r"А) $8$", False),
            (r"Б) $10$", False),
            (r"В) $30$", False),
            (r"Г) $7$", True),
            (r"Д) $3$", False)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"Знайдіть розмах ряду даних: $8, 8, 9, 12, 13$.",
        "svg_code": "",
        "options": [
            (r"А) $5$", True),
            (r"Б) $13$", False),
            (r"В) $50$", False),
            (r"Г) $8$", False),
            (r"Д) $6$", False)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "SHORT",
        "difficulty": 1,
        "text": r"Знайдіть розмах ряду даних: $1, 3, 3, 3, 5, 7, 8$.",
        "svg_code": "",
        "answer": "7",
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"У класі $30$ учнів, з них $12$ дівчат. Яка ймовірність того, що навмання обраний учень — хлопець?",
        "svg_code": "",
        "options": [
            (r"А) $\frac{1}{30}$", False),
            (r"Б) $\frac{2}{3}$", False),
            (r"В) $\frac{3}{5}$", True),
            (r"Г) $\frac{2}{5}$", False),
            (r"Д) $\frac{3}{2}$", False)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    },
    {
        "type": "CHOICE",
        "difficulty": 1,
        "text": r"У класі $28$ учнів, з них $14$ дівчат. Яка ймовірність того, що навмання обраний учень — хлопець?",
        "svg_code": "",
        "options": [
            (r"А) $\frac{1}{2}$", True),
            (r"Б) $\frac{1}{28}$", False),
            (r"В) $\frac{3}{2}$", False),
            (r"Г) $2$", False),
            (r"Д) $1$", False)
        ],
        "topic_tags": ["29. Початки теорії ймовірностей та елементи статистики"]
    }
]
